<?php
/**优先级由低到高排序
 * 结合方向   运算符                       说明
 *   无      clone new                  clone 和 new
 *   左      [                          array()
 *   右      **                         算术运算符
 *   右      ++ -- ~ @                  类型和递增／递减
 *           (int) (float) (string)
 *           (array) (object) (bool)
 *   无      instanceof                 类型
 *   右      !                          逻辑运算符
 *   左      * / %                      算术运算符
 *   左      + - .                      算术运算符和字符串运算符
 *   左      << >>                      位运算符
 *   无      < <= > >=                  比较运算符
 *   无      == != === !== <> <=>       比较运算符
 *   左      &                          位运算符和引用
 *   左      ^                          位运算符
 *   左      |                          位运算符
 *   左      &&                         逻辑运算符
 *   左      ||                         逻辑运算符
 *   左      ??                         比较运算符
 *   左      ? :                        三元运算符
 *   右      = += -= *= **=             赋值运算符
 *           /= .= %= &=
 *           |= ^= <<= >>=
 *   左      and                        逻辑运算符
 *   左      xor                        逻辑运算符
 *   左      or                         逻辑运算符
 */

$a = 3 * 3 % 5;
$b = true ? 0 : true ? 1 : 2;

$c = 1;
$d = 2;
$c = $d += 3;
echo '$a: ' . $a . '<br/>';
echo '$b: ' . $b . '<br/>';
echo '$c: ' . $c . '<br/>';
echo '$d: ' . $d . '<br/>';

$e = 1;
echo $e + $e++; // may print either 2 or 3

$i = 1;
$array[$i] = $i++; // may set either index 1 or 2